---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarCoupler.CouplerMark
source: html/8381cc59-9dff-664c-682b-84d0086f93c1.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler.CouplerMark Property

gets and sets the coupler mark

## Syntax (C#)
```csharp
public string CouplerMark { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null